ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project2/self/uart/serial.c
/*------------------------------------------------------------------------------
serial.c


------------------------------------------------------------------------------*/

#include "../main.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"
#include "inc/hw_uart.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "utils/ringbuf.h"
#include "serial.h"



// The size of the ring buffers used for interface between the UART and telnet session (RX).
#define RX_RING_BUF_SIZE        (2048 * 2)

// The size of the ring buffers used for interface between the UART and telnet session (TX).
#define TX_RING_BUF_SIZE        (2048 * 6)



// The buffer used to hold characters received from the UARTs.
static uint8_t mmbRxBuf[UART_COUNT][RX_RING_BUF_SIZE];

// The buffer used to hold characters to be sent to the UARTs.
static uint8_t mmbTxBuf[UART_COUNT][TX_RING_BUF_SIZE];



// The ring buffers used to hold characters received from the UARTs.
tRingBufObject g_sRxBuf[UART_COUNT];

// The ring buffers used to hold characters to be sent to the UARTs.
tRingBufObject g_sTxBuf[UART_COUNT];


// The base address for the UART associated with a port.
const uint32_t g_ulUARTBase[UART_COUNT] =
{
    UART0_BASE,
#ifndef SINGLE_UART
    UART4_BASE,
    UART3_BASE,
    UART2_BASE,
    UART1_BASE,
#endif
};

// The interrupt address for the UART associated with a port.
const uint32_t g_ulIntUART[UART_COUNT] =
{
    INT_UART0,
#ifndef SINGLE_UART
    INT_UART4,
    INT_UART3,
    INT_UART2,
    INT_UART1,
#endif
};



volatile uint16_t mcwUARTTxOut[UART_COUNT];



#if false
//*****************************************************************************
//! Handles the serial flow control interrupt.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function is called when the GPIO interrupt occurs for a serial port
//! flow control GPIO input.  This function will clear the appropriate
//! interrupt condition, and will toggle the transmitter status based on the
//! flow control input signal level and the flow control setting.
//!
//! \return None.
//*****************************************************************************
static void
SerialFlowInIntHandler(uint32_t ulPort)
{
    uint32_t ulStatus;
#if CONFIG_RFC2217_ENABLED
    uint8_t ucModemState;
#endif

    // Clear the interrupt condition.
    ulStatus = GPIOIntStatus(g_ulFlowInBase[ulPort], true);
    GPIOIntClear(g_ulFlowInBase[ulPort], ulStatus);

    // If flow control is enabled, check the status of the pin and
    // enable/disable the UART transmitter appropriately.
    if(g_sParameters.sPort[ulPort].ucFlowControl == SERIAL_FLOW_CONTROL_HW)
    {
        if(GPIOPinRead(g_ulFlowInBase[ulPort], g_ulFlowInPin[ulPort]))
        {
            // Indicate the CTS (actually flow control input) has changed
            // state to be asserted.
#if CONFIG_RFC2217_ENABLED
            ucModemState = (16 + 1);
#endif
            HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) &= ~UART_CTL_TXE;
        }
        else
        {
            // Indicate the CTS (actually flow control input) has changed
            // state to be deasserted.
#if CONFIG_RFC2217_ENABLED
            ucModemState = (0 + 1);
#endif
            HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) |= UART_CTL_TXE;
        }

        // Notify the telnet RFC2217 process that RTS (actually flow control
        // input) has chagned state.
#if CONFIG_RFC2217_ENABLED
        TelnetNotifyModemState(ulPort, ucModemState);
#endif
    }
}

//*****************************************************************************
//! Handles the GPIO B interrupt for flow control (port 0).
//!
//! This function is called when the GPIO port B generates an interrupt.  An
//! interrupt will be generated when the inbound flow control signal changes
//! levels (rising/falling edge).  A notification function will be called to
//! inform the corresponding telnet session that the flow control signal has
//! changed.
//!
//! \return None.
//*****************************************************************************
void
SerialGPIOBIntHandler(void)
{
    // Call the generic flow control interrupt routine.
    SerialFlowInIntHandler(0);
}

//*****************************************************************************
//! Handles the GPIO A interrupt for flow control (port 1).
//!
//! This function is called when the GPIO port A generates an interrupt.  An
//! interrupt will be generated when the inbound flow control signal changes
//! levels (rising/falling edge).  A notification function will be called to
//! inform the corresponding telnet session that the flow control signal has
//! changed.
//!
//! \return None.
//*****************************************************************************
void
SerialGPIOAIntHandler(void)
{
    // Call the generic flow control interrupt routine.
    SerialFlowInIntHandler(1);
}

//*****************************************************************************
//! Enables transmitting and receiving.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! Sets the UARTEN, and RXE bits, and enables the transmit and receive
//! FIFOs.  Optionally sets the TXE bit if flow control conditions allow.
//!
//! \return None.
//*****************************************************************************
static void
SerialUARTEnable(uint32_t ulPort)
{
    // Enable the FIFO.
    HWREG(g_ulUARTBase[ulPort] + UART_O_LCRH) |= UART_LCRH_FEN;

    // Enable RX and the UART.
    HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) |= UART_CTL_UARTEN | UART_CTL_RXE;

    // If flow control is enabled and asserted, don't enable the transmitter.
    // Otherwise, enable it.
    if(!((g_sParameters.sPort[ulPort].ucFlowControl ==
          SERIAL_FLOW_CONTROL_HW) &&
         GPIOPinRead(g_ulFlowInBase[ulPort], g_ulFlowInPin[ulPort])))
    {
        HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) |= UART_CTL_TXE;
    }
}

//*****************************************************************************
//! Configures the serial port baud rate.
//!
//! \param ulPort is the serial port number to be accessed.
//! \param ulBaudRate is the new baud rate for the serial port.
//!
//! This function configures the serial port's baud rate.  The current
//! configuration for the serial port will be read.  The baud rate will be
//! modified, and the port will be reconfigured.
//!
//! \return None.
//*****************************************************************************
void
SerialSetBaudRate(uint32_t ulPort, uint32_t ulBaudRate)
{
    uint32_t ulDiv, ulUARTClk;

    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);
    ASSERT(ulBaudRate != 0);

    // Save the baud rate for future reference.
    g_ulCurrentBaudRate[ulPort] = ulBaudRate;

