ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project2/self/uart/serial.c
    // Stop the UART.
    UARTDisable(g_ulUARTBase[ulPort]);

    // Get the current configuration of the UART.
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    // Update the configuration with a new parity.
    switch(ucParity)
    {
        case SERIAL_PARITY_NONE:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_PAR_MASK);
            ulNewConfig |= UART_CONFIG_PAR_NONE;
            g_sParameters.sPort[ulPort].ucParity = ucParity;
            break;
        }

        case SERIAL_PARITY_ODD:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_PAR_MASK);
            ulNewConfig |= UART_CONFIG_PAR_ODD;
            g_sParameters.sPort[ulPort].ucParity = ucParity;
            break;
        }

        case SERIAL_PARITY_EVEN:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_PAR_MASK);
            ulNewConfig |= UART_CONFIG_PAR_EVEN;
            g_sParameters.sPort[ulPort].ucParity = ucParity;
            break;
        }

        case SERIAL_PARITY_MARK:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_PAR_MASK);
            ulNewConfig |= UART_CONFIG_PAR_ONE;
            g_sParameters.sPort[ulPort].ucParity = ucParity;
            break;
        }

        case SERIAL_PARITY_SPACE:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_PAR_MASK);
            ulNewConfig |= UART_CONFIG_PAR_ZERO;
            g_sParameters.sPort[ulPort].ucParity = ucParity;
            break;
        }

        default:
        {
            ulNewConfig = ulCurrentConfig;
            break;
        }
    }

    // Set parity, data length, and number of stop bits.
    HWREG(g_ulUARTBase[ulPort] + UART_O_LCRH) = ulNewConfig;

    // Clear the flags register.
    HWREG(g_ulUARTBase[ulPort] + UART_O_FR) = 0;

    // Start the UART.
    SerialUARTEnable(ulPort);
}

//*****************************************************************************
//! Queries the serial port parity.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function will read the UART configuration and return the currently
//! configured parity for the selected port.
//!
//! \return Returns the current parity setting for the port.  This will be one
//! of \b SERIAL_PARITY_NONE, \b SERIAL_PARITY_ODD, \b SERIAL_PARITY_EVEN,
//! \b SERIAL_PARITY_MARK, or \b SERIAL_PARITY_SPACE.
//*****************************************************************************
uint8_t
SerialGetParity(uint32_t ulPort)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig;
    uint8_t ucCurrentParity;

    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Get the current configuration of the UART.
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    // Determine the current data size.
    switch(ulCurrentConfig & UART_CONFIG_PAR_MASK)
    {
        case UART_CONFIG_PAR_NONE:
        {
            ucCurrentParity = SERIAL_PARITY_NONE;
            break;
        }

        case UART_CONFIG_PAR_ODD:
        {
            ucCurrentParity = SERIAL_PARITY_ODD;
            break;
        }

        case UART_CONFIG_PAR_EVEN:
        {
            ucCurrentParity = SERIAL_PARITY_EVEN;
            break;
        }

        case UART_CONFIG_PAR_ONE:
        {
            ucCurrentParity = SERIAL_PARITY_MARK;
            break;
        }

        case UART_CONFIG_PAR_ZERO:
        {
            ucCurrentParity = SERIAL_PARITY_SPACE;
            break;
        }

        default:
        {
            ucCurrentParity = SERIAL_PARITY_NONE;
            break;
        }
    }

    // Return the current data size.
    return(ucCurrentParity);
}

//*****************************************************************************
//! Configures the serial port stop bits.
//!
//! \param ulPort is the serial port number to be accessed.
//! \param ucStopBits is the new stop bits for the serial port.
//!
//! This function configures the serial port's stop bits.  The current
//! configuration for the serial port will be read.  The stop bits will be
//! modified, and the port will be reconfigured.
//!
//! \return None.
//*****************************************************************************
void
SerialSetStopBits(uint32_t ulPort, uint8_t ucStopBits)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig, ulNewConfig;

    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);
    ASSERT((ucStopBits >= 1) && (ucStopBits <= 2));

    // Stop the UART.
    UARTDisable(g_ulUARTBase[ulPort]);

    // Get the current configuration of the UART.
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    // Update the configuration with a new stop bits.
    switch(ucStopBits)
    {
        case 1:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_STOP_MASK);
            ulNewConfig |= UART_CONFIG_STOP_ONE;
            g_sParameters.sPort[ulPort].ucStopBits = ucStopBits;
            break;
        }

        case 2:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_STOP_MASK);
            ulNewConfig |= UART_CONFIG_STOP_TWO;
            g_sParameters.sPort[ulPort].ucStopBits = ucStopBits;
            break;
        }

        default:
        {
            ulNewConfig = ulCurrentConfig;
            break;
        }
    }

    // Set parity, data length, and number of stop bits.
    HWREG(g_ulUARTBase[ulPort] + UART_O_LCRH) = ulNewConfig;

    // Clear the flags register.
    HWREG(g_ulUARTBase[ulPort] + UART_O_FR) = 0;

    // Start the UART.
    SerialUARTEnable(ulPort);
}

//*****************************************************************************
//! Queries the serial port stop bits.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function will read the UART configuration and return the currently
//! configured stop bits for the selected port.
//!
//! \return None.
//*****************************************************************************
uint8_t
SerialGetStopBits(uint32_t ulPort)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig;
    uint8_t ucCurrentStopBits;

    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Get the current configuration of the UART.
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    // Determine the current data size.
    switch(ulCurrentConfig & UART_CONFIG_STOP_MASK)
    {
        case UART_CONFIG_STOP_ONE:
        {
            ucCurrentStopBits = 1;
            break;
        }

        case UART_CONFIG_STOP_TWO:
        {
            ucCurrentStopBits = 2;
            break;
        }

        default:
        {
            ucCurrentStopBits = 0;
            break;
        }
    }

    // Return the current data size.
    return(ucCurrentStopBits);
}

//*****************************************************************************
//! Sets the serial port flow control output signal.
//!
//! \param ulPort is the UART port number to be accessed.
//! \param ucFlowValue is the value to program to the flow control pin.  Valid
//! values are \b SERIAL_FLOW_OUT_SET and \b SERIAL_FLOW_OUT_CLEAR.
//!
//! This function will set the flow control output pin to a specified value.
//!
//! \return None.
//*****************************************************************************
void
SerialSetFlowOut(uint32_t ulPort, uint8_t ucFlowValue)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);
    ASSERT((ucFlowValue == SERIAL_FLOW_OUT_SET) ||
           (ucFlowValue == SERIAL_FLOW_OUT_CLEAR));

    // If we are to assert the pin, save the value and assert the pin.
    if(ucFlowValue == SERIAL_FLOW_OUT_SET)
    {
        g_ulSetFlowOutValue[ulPort] = g_ulFlowOutPin[ulPort];
        GPIOPinWrite(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort],
                     g_ulFlowOutPin[ulPort]);
    }

    // If we are to deassert the pin, save the value, and deassert the pin
    // only if flow control would be deasserted anyway (in other words, the
    // fifo level is ok).
    else
    {
        g_ulSetFlowOutValue[ulPort] = 0;

        // If flow control is enabled, check the status of the RX buffer to
        // determine if flow control GPIO needs to be de-asserted.
        if(g_sParameters.sPort[ulPort].ucFlowControl == SERIAL_FLOW_CONTROL_HW)
        {
            // If the ring buffer is down to less than 25% used,
            // de-assert the outbound flow control pin.
            if(RingBufUsed(&g_sRxBuf[ulPort]) <
               (RingBufSize(&g_sRxBuf[ulPort]) / 4))
            {
                GPIOPinWrite(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort],
                             0);
            }
        }
        else
        {
            GPIOPinWrite(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort], 0);
        }
    }
}

//*****************************************************************************
//! Gets the serial port flow control output signal.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! This function will set the flow control output pin to a specified value.
//!
//! \return Returns \b SERIAL_FLOW_OUT_SET or \b SERIAL_FLOW_OUT_CLEAR.
//*****************************************************************************
uint8_t
SerialGetFlowOut(uint32_t ulPort)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // If flow control is set (ON) return an "11", otherwise, return
    // a "12" (based on the RFC2217 values).
    if(GPIOPinRead(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort]) ==
       g_ulFlowOutPin[ulPort])
    {
        return(SERIAL_FLOW_OUT_SET);
    }
    else
    {
        return(SERIAL_FLOW_OUT_CLEAR);
    }
}

//*****************************************************************************
//! Configures the serial port flow control option.
//!
//! \param ulPort is the UART port number to be accessed.
//! \param ucFlowControl is the new flow control setting for the serial port.
//!
//! This function configures the serial port's flow control.  This function
//! will enable/disable the flow control interrupt and the UART transmitter
//! based on the value of the flow control setting and/or the flow control
//! input signal.
//!
//! \return None.
//*****************************************************************************
void
SerialSetFlowControl(uint32_t ulPort, uint8_t ucFlowControl)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);
    ASSERT((ucFlowControl == SERIAL_FLOW_CONTROL_NONE) ||
           (ucFlowControl == SERIAL_FLOW_CONTROL_HW));

