ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project2/self/uart/serial.c
    // Save the new flow control setting.
    g_sParameters.sPort[ulPort].ucFlowControl = ucFlowControl;

    // If flow control is enabled.
    if(g_sParameters.sPort[ulPort].ucFlowControl == SERIAL_FLOW_CONTROL_HW)
    {
        // Enable/Disable the transmitter, based on the flow control
        // input pin status.
        if(GPIOPinRead(g_ulFlowInBase[ulPort], g_ulFlowInPin[ulPort]))
        {
            HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) &= ~UART_CTL_TXE;
        }
        else
        {
            HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) |= UART_CTL_TXE;
        }

        // Enable the Flow Control interrupt.
        IntEnable(g_ulFlowInterrupt[ulPort]);
    }

    // If flow control is disabled.
    else
    {
        // Disable the Flow Control interrupt.
        IntDisable(g_ulFlowInterrupt[ulPort]);

        // Enable the transmitter.
        HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) |= UART_CTL_TXE;
    }
}

//*****************************************************************************
//! Queries the serial port flow control.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function will return the currently configured flow control for
//! the selected port.
//!
//! \return None.
//*****************************************************************************
uint8_t
SerialGetFlowControl(uint32_t ulPort)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Return the current flow control.
    return(g_sParameters.sPort[ulPort].ucFlowControl);
}

//*****************************************************************************
//! Purges the serial port data queue(s).
//!
//! \param ulPort is the serial port number to be accessed.
//! \param ucPurgeCommand is the command indicating which queue's to purge.
//!
//! This function will purge data from the tx, rx, or both serial port queues.
//!
//! \return None.
//*****************************************************************************
void
SerialPurgeData(uint32_t ulPort, uint8_t ucPurgeCommand)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);
    ASSERT((ucPurgeCommand >= 1) && (ucPurgeCommand <= 3));

    // Disable the UART.
    UARTDisable(g_ulUARTBase[ulPort]);

    // Purge the receive data if requested.
    if(ucPurgeCommand & 0x01)
    {
        RingBufFlush(&g_sRxBuf[ulPort]);
    }

    // Purge the transmit data if requested.
    if(ucPurgeCommand & 0x02)
    {
        RingBufFlush(&g_sTxBuf[ulPort]);
    }

    // Renable the UART.
    SerialUARTEnable(ulPort);
}

//*****************************************************************************
//! Configures the serial port to a default setup.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! This function resets the serial port to a default configuration.
//!
//! \return None.
//*****************************************************************************
void
SerialSetDefault(uint32_t ulPort)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Disable interrupts.
    IntDisable(g_ulUARTInterrupt[ulPort]);

    // Set the baud rate.
    SerialSetBaudRate(ulPort, g_psDefaultParameters->sPort[ulPort].ulBaudRate);

    // Set the data size.
    SerialSetDataSize(ulPort, g_psDefaultParameters->sPort[ulPort].ucDataSize);

    // Set the parity.
    SerialSetParity(ulPort, g_psDefaultParameters->sPort[ulPort].ucParity);

    // Set the stop bits.
    SerialSetStopBits(ulPort, g_psDefaultParameters->sPort[ulPort].ucStopBits);

    // Set the flow control.
    SerialSetFlowControl(ulPort, g_psDefaultParameters->sPort[ulPort].ucFlowControl);

    // Purge the Serial Tx/Rx Ring Buffers.
    SerialPurgeData(ulPort, 0x03);

    // (Re)enable the UART transmit and receive interrupts.
    UARTIntEnable(g_ulUARTBase[ulPort], (UART_INT_RX | UART_INT_RT | UART_INT_TX));
    IntEnable(g_ulUARTInterrupt[ulPort]);
}

//*****************************************************************************
//! Configures the serial port according to the current working parameter
//! values.
//!
//! \param ulPort is the UART port number to be accessed.  Valid values are 0
//! and 1.
//!
//! This function configures the serial port according to the current working
//! parameters in g_sParameters.sPort for the specified port.  The actual
//! parameter set is then read back and g_sParameters.sPort updated to ensure
//! that the structure is correctly synchronized with the hardware.
//!
//! \return None.
//*****************************************************************************
void
SerialSetCurrent(uint32_t ulPort)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Disable interrupts.
    IntDisable(g_ulUARTInterrupt[ulPort]);

    // Set the baud rate.
    SerialSetBaudRate(ulPort, g_sParameters.sPort[ulPort].ulBaudRate);
    g_sParameters.sPort[ulPort].ulBaudRate = SerialGetBaudRate(ulPort);

    // Set the data size.
    SerialSetDataSize(ulPort, g_sParameters.sPort[ulPort].ucDataSize);
    g_sParameters.sPort[ulPort].ucDataSize = SerialGetDataSize(ulPort);

    // Set the parity.
    SerialSetParity(ulPort, g_sParameters.sPort[ulPort].ucParity);
    g_sParameters.sPort[ulPort].ucParity = SerialGetParity(ulPort);

    // Set the stop bits.
    SerialSetStopBits(ulPort, g_sParameters.sPort[ulPort].ucStopBits);
    g_sParameters.sPort[ulPort].ucStopBits = SerialGetStopBits(ulPort);

    // Set the flow control.
    SerialSetFlowControl(ulPort, g_sParameters.sPort[ulPort].ucFlowControl);
    g_sParameters.sPort[ulPort].ucFlowControl = SerialGetFlowControl(ulPort);

    // Purge the Serial Tx/Rx Ring Buffers.
    SerialPurgeData(ulPort, 0x03);

    // (Re)enable the UART transmit and receive interrupts.
    UARTIntEnable(g_ulUARTBase[ulPort], (UART_INT_RX | UART_INT_RT | UART_INT_TX));
    IntEnable(g_ulUARTInterrupt[ulPort]);
}

//*****************************************************************************
//! Configures the serial port to the factory default setup.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! This function resets the serial port to a default configuration.
//!
//! \return None.
//*****************************************************************************
void
SerialSetFactory(uint32_t ulPort)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Disable interrupts.
    IntDisable(g_ulUARTInterrupt[ulPort]);

    // Set the baud rate.
    SerialSetBaudRate(ulPort, g_psFactoryParameters->sPort[ulPort].ulBaudRate);

